In [38]:
import pandas as pd
import numpy as np
import random

##### .apply()
- df.apply(func, axis = 0 or 1)
- 행이나 열단위로 더 복잡한 처리를 하고 싶을 때 사용
- Pandas의 객체에 다른 라이브러리 함수를 적용하는 방법
- Pandas의 객체에 열 혹은 행에 대해 함수를 적용하게 해주는 방법

In [39]:
data_dic = {'A' : [1,3,3,4,4], 'B' : [1,2,2,3,3], 'C':[1,2,4,4,5]}
df=pd.DataFrame(data_dic)
df

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [40]:
#apply를 사용하여 각 열에 대해 어떤 값이 얼마나 사용되었는지 알아보자
df2 = df.apply(pd.value_counts)
df2

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

##### .fillna()
- NaN(결측치)를 원하는 값으로 변경시켜주는 함수
- 변수명.fillna(원하는 값)

In [41]:
df2.fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

##### 카테고리 만들기

In [42]:
#ages: 나이
ages = [0,2,10,21,23,37,31,61,20,41,32,100]

#bins: 구간
bins=[0,15,25,35,60,99]

#labels: 구분
labels=["미성년자", "청년", "중년", "장년", "노년"]

cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [43]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [44]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [45]:
ageArr=pd.DataFrame(ages, columns = ['ages'])
ageArr

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

In [46]:
ageArr['age_cat'] = cats
ageArr

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

##### value_counts 함수
- 값이 숫자, 문자열, 카테고리 값인 경우에 각각의 값이 나온 횟수를 세는 기능

In [49]:
#NaN값들은 제외하고 횟수를 세줌
ageArr['age_cat'].value_counts()

청년      3
미성년자    2
중년      2
장년      2
노년      1
Name: age_cat, dtype: int64